#Ввести с клавиатуры строку.
#Вывести эту же строку вертикально: по одному символу на строку консоли.

user_input = input('Введите строку с клавиатуры')

for letter in user_input:
    print(letter)