#Создать список из десяти целых чисел.
#Вывести на экран каждое число, увеличенное на 1.

whole_numbers = {1,2,3,4,5,6,7,8,9,10}

for number in whole_numbers:
  print(number+1)

